app/Http/Controllers/QuestionsController.php

select * from `questions` order by `created_at` desc limit 5 offset 0
select * from `users` where `users`.`id` in (2)
select count(*) as aggregate from `questions`
---
    public function index()
    {
//        DB::enableQueryLog();
        $questions = Question::with('user')->latest()->paginate(5);